<h2> Постановка задачи </h2>
Напишите программу на языке Python, в которой будет реализовано решение задачи (соответствующего вашему номеру всписке студентов) варианта. Описание задачи дано ниже.
* Код требуется оформить в виде функциии предусмотреть ввод некорректных значений. Задачу требуется решить, используя сервис trinket.io, ссылку на доску с решением поместить вблоге.
* Код требуется протестировать, см. страницу в курсе «Правила публикации заданий». 
Замечания по реализации−для ввода значений с клавиатуры используйте метод input();−для использования некоторых функций удобн оиспользовать библиотеку **math**.

Для использования библиотеки **math** необходимо:
1. подключить её с помощью команды import, 
2. обращаться к свойствам и методам. Например,выведем константу e наэкран:
```python
import mathprint(math.e)
```
    >> 2.718281828459045

<h2> Текст программы: </h2>

```python
print('#4')
#V = (1/3)*h*S => S = 3*V/h
#В правильной четырехугольной пирамиде высота равна h, объем равен v. Найдите боковое ребро этой пирамиды.

def rib(h,v):
  """
  Фунция с двумя позиционными аргументами, возращающая значение переменной 'l'
  
  """
  S = 3*v/h
  a_a = S
  d = (a_a + a_a)**(1/2)
  d_2 = d / 2
  l = (d_2**2 + h**2)**(1/2)
  return l
  
print('l = ', rib(12,200))

assert rib(12,200) == 13, " Ошибка! Должно быть 13"
assert rib(14,200) > 0, " Ошибка! Боковое ребро не может быть отрицательным! "
assert rib(14,200) != 0, " Ошибка! Боковое ребро не может равным 0! "

print('#8')
#Найдите площадь поверхности прямой призмы, в основани икоторой лежит ромб с диагоналями, равными d1 и d2, ибоковымребром, равным h

def square(d1,d2,h):
  """
  Фунция с тремя позиционными аргументами, возращающая значение переменной 's'
  
  """
  S_o = (d1 * d2)/2
  a = ((d1/2)**2 + (d2/2)**2)**(1/2)
  S_b = a * h
  s = 2*S_o + 4*S_b
  return s
  
print('S = ',square(6,8,10))

assert square(6,8,10) == 248, " Ошибка! Должно быть 248"
assert square(6,8,10) > 0, " Ошибка! Площадь поверхности не может быть отрицательной! "
assert square(6,8,10) != 0, " Ошибка! Площадь поверхности не может быть равной 0!"

```
<h2> Результат выполнения программы: </h2>

    #4
    l =  13.0
    #8
    S =  248.0
